package TasksJavaRush.Course_0;
/*
Сейчас 3126 год. Мой друг родился 8 лет назад.
Написать программу, выводящую на экран год рождения моего друга.
 */
public class Solution4 {
    public void javaRush() {
        int x = 3118;
        System.out.println(x);
    }
}
