package TasksJavaRush.Course_1;

/*
Дана переменная number.
Напиши программу,
которая выводит на экран квадрат этой переменной
(number * number).
 */
public class Solution4 {
    public  int number = 25;
    public void javaRush() {
        System.out.println(number * number);
    }
}
