package com.ZadachiJavaRush.Course_0;
/*
Написать программу, выводящую на экран надпись
 "Элли самая красивая" 5 раз.
 Каждый раз - с новой строки.

Пример вывода на экран:
Элли самая красивая
Элли самая красивая
Элли самая красивая
Элли самая красивая
Элли самая красивая
 */
public class Solution3 {
    public static void main(String[] args) {
//        for(int i = 0;i<5;i++){                       // быстрый вариант
//        System.out.println("Элли самая красивая");
//        }
         System.out.println("Элли самая красивая");
         System.out.println("Элли самая красивая");
         System.out.println("Элли самая красивая");
         System.out.println("Элли самая красивая");
         System.out.println("Элли самая красивая");
    }

}
