package TasksJavaRush.Course_5;
import java.io.IOException;

/*
Вывести на экран текущую дату в аналогичном виде "21 02 2014".
 */
public class Solution29 {
    public void javaRush() throws IOException {
        System.out.printf("12 04 2020");
    }
}