//package com.ZadachiJavaRush.Course_19.Solution_19;
//
///**
// * В метод main первым параметром приходит имя файла.
// * В этом файле каждая строка имеет следующий вид:
// * имя значение
// * где [имя] - String, [значение] - double. [имя] и [значение] разделены пробелом.
// *
// * Для каждого имени посчитать сумму всех его значений.
// * Все данные вывести в консоль, предварительно отсортировав в возрастающем порядке по имени.
// * Закрыть потоки.
// *
// * Пример входного файла:   Пример вывода:
// * Петров 2                 Иванов 1.35
// * Сидоров 6                Петров 5.1
// * Иванов 1.35              Сидоров 6.0
// * Петров 3.1
// */
//public class Solution {
//    public void javaRush() {
//        //
//    }
//}
