package com.TasksJavaRush.Course_3;
/*
Вывести на экран десять раз надпись
"Я хочу большую зарплату, и для этого изучаю Java"
 */
public class Solution25 {
    public void javaRush() {
        for (int i = 0; i <10 ; i++) {
            System.out.println("Я хочу большую зарплату, и для этого изучаю Java");
        }

    }
}
