package com.TasksJavaRush.Course_4;
import java.io.IOException;
/*
Вывести на экран числа от 1 до 10 используя цикл while.
Каждое значение с новой строки.
 */
public class

Solution30 {
    public void javaRush() throws IOException {
        int a = 1;
        while (a <= 10){
            System.out.println(a);
            a++;
        }

    }
}
